{"documentacao_stride": ["The simplest way to apply the STRIDE model to your application is to consider how each of the threats in the model affects each Commerce Server component and each of its connections or relationships with other application components. Essentially, you look at each part of the application and determine whether any threats that fall into the S, T, R, I, D, or E categories above exist for that component or process. Most parts will have numerous threats, and it is important that you record all of them. Following are some sample threats to a Web site. Note that this is a highly abridged list. In a two-hour threat-analysis meeting you will likely be able to identify 20 to 40 security threats. The STRIDE Threat Model STRIDE Threats in Commerce Server Copyright Â© 2005 Microsoft Corporation.All rights reserved.", "When you are considering threats, it is useful to ask questions such as these: You can group threats into categories to help you formulate these kinds of pointed questions. One model you may find useful is STRIDE, derived from an acronym for the following six threat categories: Applying STRIDE STRIDE Threats in Commerce Server Copyright Â© 2005 Microsoft Corporation.All rights reserved.", "It is important that you identify the threats to your Commerce Server installation. You need to consider the possibility of threats to the following types of data: To identify the threats to this data, you should outline the overall architecture of your system, including: Then, hold a meeting that includes at least one member from each of the disciplines in your organization, for example, a Web designer, a developer, a system administrator, and a technical writer. Review the overall architecture and attempt to identify as many security threats as possible. The objective of this meeting is to identify potential threats, not to solve the problems they present. Create a table that lists the core processes, persistent and temporary data, and communications protocols for your application, such as the following sample table. In the next stage, you will group and analyze the threats to these components and protocols. This section contains: Copyright Â© 2005 Microsoft Corporation.All rights reserved."]}